Revit 2023 API
GroupTypeId.StructuralAnalysis Property
 "Structural Analysis"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId StructuralAnalysis { get; }
Visual Basic
Public Shared ReadOnly Property StructuralAnalysis As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralAnalysis {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace